## EDA을 위한 다양한 pandas function 연습  
---
참고링크 : https://pandas.pydata.org/docs/user_guide/10min.html  
한글 : https://dandyrilla.github.io/2017-08-12/pandas-10min/

API ref : https://pandas.pydata.org/docs/reference/index.html

In [63]:
import numpy as np
import pandas as pd

### series and dataFrame 

차이점을 기억해 두자  
series 1차 배열  
dataFrame 2차 배열  

실제 data 특성에 맞는 샘플 데이터를 만들수 있어야 한다.   
해당 샘플 데이터로 각 연산 결과를 미리 확인 할 수 있어야 한다.   
print(type()) 을 이용하여 object 의 타입을 정확히 파악해야 한다.  
( series[index_label] vs dataframe[column_label] )  
answer.ipynb 와 test.ipynb, sample.ipynb 으로 운영한다. 

```
pd.DataFrame( Serise, 
              columns = ['',''])
              index = lsit
            )

pd.DataFrame(
    { 
      'A': list
      'B': ['', '']
    },
    index=['','']
    )
```

In [64]:
pd.DataFrame({ 
    'B': ['B', 'C'],
}, index= [1,2])

   B
1  B
2  C

In [65]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [66]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [67]:
# df 만드든 방법 1

df = pd.DataFrame(np.random.randn(6, 4),
                   index=dates, 
                   columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

In [68]:
S = df.A
S[1:]   # silicing

S[1]  # serise indexiting
S[S>1] # serise masking

Series([], Freq: D, Name: A, dtype: float64)

In [69]:

D = df[['A','B']]

D[1:]   # df slicing
# D[1]    # indexing 은 오류
D[D>1]

             A         B
2013-01-01 NaN       NaN
2013-01-02 NaN  1.245495
2013-01-03 NaN       NaN
2013-01-04 NaN       NaN
2013-01-05 NaN  1.145290
2013-01-06 NaN  1.671967

dataFrame :   
DataFrame은 2차원 배열 데이터라고 이해하는 것보다 공통 인덱스를 가진 column series를 딕셔너리로 묶어놓은 것

In [70]:
# df 만드는 방법 2 

df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2 
# df2[:]
# df2[:][:]
# df2.loc[:,:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### 2. Viewing Data

In [71]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [72]:
print(df.head(2),'\n')

print(df.tail(2), '\n')

print(df.index, '\n')

print(df.columns, '\n')

df.describe()

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383

                   A         B         C         D
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'C', 'D'], dtype='object')

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -1.066419  0.716628  0.225818  0.788042
std    1.197548  0.799075  1.025813  0.911136
min   -2.932764 -0.538197 -1.434322 -0.285383
25%   -1.469777  0.331277 -0.044064  0.244110
50%   -1.211037  0.822779  0.290867  0.520958
75%   -0.215608  1.220443  0.576517  1.435832
max    0.396147  1.671967  1.691469  2.079102

In [73]:
# 행, 열을 바꾼다. 

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.019998   -1.402076    0.396147    0.052522   -1.492344   -2.932764
B    0.274947    1.245495   -0.538197    0.500269    1.145290    1.671967
C    0.546842   -0.070383   -1.434322    0.034893    1.691469    0.586408
D    0.723578   -0.285383    2.079102    0.219367    0.318339    1.673250

In [74]:
df.to_numpy()

array([[-1.01999812,  0.27494691,  0.54684158,  0.7235776 ],
       [-1.40207647,  1.24549459, -0.07038335, -0.28538332],
       [ 0.39614657, -0.53819744, -1.43432153,  2.07910219],
       [ 0.0525225 ,  0.50026891,  0.03489281,  0.21936667],
       [-1.49234404,  1.14528952,  1.69146907,  0.31833899],
       [-2.93276361,  1.67196703,  0.58640814,  1.67325001]])

In [75]:
df.select_dtypes(include='int64')

Empty DataFrame
Columns: []
Index: [2013-01-01 00:00:00, 2013-01-02 00:00:00, 2013-01-03 00:00:00, 2013-01-04 00:00:00, 2013-01-05 00:00:00, 2013-01-06 00:00:00]

In [76]:
df.select_dtypes(include='number')

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

value_counts()

df.value_counts()   : 1 이상이면 동일한 row 존재  (전부 1이면, 다 값이 다르고, 실재 row 갯수 만큼 나온다.)  
series.value_counts() : 1 이상이면 동일한 값 존재

### 3. Selection 

df[1] : 인텍싱  '정수일때만 가능 (df[df.index == 1] 가 같음), 주로 df 'column' 선택에 사용  
df[2:4] : 슬라이싱  
df[df>1] : 마스킹  

=> 주로 Serise 을 사용할때 사용한다고 생각하자. series[1] / series[2:4] / serise[serise>1]

.             : ```df.col```  
[]            : ```df[column]```         , * df[row_lable: ] 은 사용하지 말자.  
loc (or at)   : df.loc[index_lable,] 은 조건일때만 사용     , ```df.loc[ : , col_label]```    
iloc (or iat) : ```df.iloc[몇번째 row]``` , df.iloc[ : , 몇번째 col]

In [77]:
print(df['A'],'\n')
print(df[:]['A'],'\n')              #df.loc[:,'A']
# df['2013-01-01':]['A']            # chained indexing ?
# df.A

## column 을 선택하게 되며 series 로 리턴된다.


print(df[['A']],'\n')               # df 으로 리턴 
df[['A','C']]                       # dataFrame 리턴

## 2개 이상, 이거나 [[ 'col' ]] 으로 1개 col 을 df 로 리턴

2013-01-01   -1.019998
2013-01-02   -1.402076
2013-01-03    0.396147
2013-01-04    0.052522
2013-01-05   -1.492344
2013-01-06   -2.932764
Freq: D, Name: A, dtype: float64

2013-01-01   -1.019998
2013-01-02   -1.402076
2013-01-03    0.396147
2013-01-04    0.052522
2013-01-05   -1.492344
2013-01-06   -2.932764
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -1.019998
2013-01-02 -1.402076
2013-01-03  0.396147
2013-01-04  0.052522
2013-01-05 -1.492344
2013-01-06 -2.932764

                   A         C
2013-01-01 -1.019998  0.546842
2013-01-02 -1.402076 -0.070383
2013-01-03  0.396147 -1.434322
2013-01-04  0.052522  0.034893
2013-01-05 -1.492344  1.691469
2013-01-06 -2.932764  0.586408

In [78]:
# 오류 

# print(df[0],'\n')                # 명시적 인덱스 0 을 찾기때문에 오류
# print(df['2013-01-01'],'\n')     # column 에서 찾기 때문에 오류 
print(df['2013-01-01':'2013-01-02'],'\n')  # 근데 이건 됨... 헐.
print(df[:'2013-01-02'],'\n')

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383

In [79]:
# df[0:3]
# df['2013-01-01':'2013-01-03']
print(df['2013-01-04':], '\n')
print(df['2013-01-04':'2013-01-04'], '\n')     # 3, 4 열, label 은 끝 포함
print(df[3:4], '\n')                           # 3열만, index 은 -1 까지
df[3:]

# row 을 선택하게 되며, dataFrame 으로 리턴된다

                   A         B         C         D
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

                   A         B         C         D
2013-01-04  0.052522  0.500269  0.034893  0.219367

                   A         B         C         D
2013-01-04  0.052522  0.500269  0.034893  0.219367

                   A         B         C         D
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

In [80]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [81]:
print(df2[:3])  # 이런 형태는 사용하지 말자.  3번째 까지, column 이랑 혼동된다.
# df2.iloc[,:3] 3번째 columns 까지 인건지, df2.iloc[:3,] 3번째 row 인건지??

print(df2.loc[:3,])  # 이것도 사용하지 말자.  3번 까지 , 3번이 어디있을줄 알고... 
# 정수형이 아니면 df.loc[:'서울',] 이건 괜찬을듯.

df2.iloc[:3,]   # 이걸 사용하자. 3번째 까지

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [82]:
#chained indexing?
print(df2[2:4]['A'],'\n')     # row / col
print(df2[2:4][0:4], '\n')     # row seriese 의 row serise
df2[2:4][0:1]                 # 2,3 row 로 만들어진 것에서 다시 0,1 row 첫번째

2    1.0
3    1.0
Name: A, dtype: float64

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D     E    F
2  1.0 2013-01-02  1.0  3  test  foo

In [83]:
df2.iloc[0]     # 암묵적 인덱스 0 번째 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 0, dtype: object

In [84]:
df2.loc[2]        # 명시적 인덱스 2 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 2, dtype: object

Row

df.shape[0] = row 행갯수

df.iloc[몇번째 row,]  
df.loc[row_label,]  ```---> row_label 대신 조건절이 들어가면 조건절은 해당 row 의 index label 을 리턴한다.```

으로만 사용

In [85]:
df2.shape, df2.shape[0], df2.shape[1]

((4, 6), 4, 6)

In [86]:
# row label (명시적, 몇번) 을 이용해서 row 을 인덱싱
# index 가 int 인 경우 df.loc[index_int] 도 가능, 
print(df.loc['20130101'],'\n')              # series
print(df.loc['20130101':'20130102'],'\n')   # dataFrame
print(df.loc[['20130101','20130102']],'\n')

# row location (암묵적 , 몇번째) index 을 이용해서 row 인덱싱
print(df.iloc[0],'\n')                      # series
print(df.iloc[0:1],'\n')                    #dataFrame
print(df.iloc[[0,1]],'\n')

A   -1.019998
B    0.274947
C    0.546842
D    0.723578
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383

A   -1.019998
B    0.274947
C    0.546842
D    0.723578
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383

Column

df.shape[1] = columns 열갯수

특정 column 은 몇번째 column 인가? 는 어떻게 찾지?

```
columns 을 추가할때는 인덱스가 없는 list 형태로 입력해야 한다. 
그렇지 않으면, 인덱스가 서로 다를때 입력이 안될수 있다. 
```

In [87]:

# column lable 을 이용해서 column 인덱싱
# print(df.loc['A'],'\n')      # 'A' 을 row 인텍싱으로 생각해서 
print(df.loc[:,'A'],'\n')
print(df.loc[:, ['A']],'\n')
print(df.loc[:,'A':'B'],'\n')
print(df.loc[:,['A','B']],'\n')

2013-01-01   -1.019998
2013-01-02   -1.402076
2013-01-03    0.396147
2013-01-04    0.052522
2013-01-05   -1.492344
2013-01-06   -2.932764
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -1.019998
2013-01-02 -1.402076
2013-01-03  0.396147
2013-01-04  0.052522
2013-01-05 -1.492344
2013-01-06 -2.932764

                   A         B
2013-01-01 -1.019998  0.274947
2013-01-02 -1.402076  1.245495
2013-01-03  0.396147 -0.538197
2013-01-04  0.052522  0.500269
2013-01-05 -1.492344  1.145290
2013-01-06 -2.932764  1.671967

                   A         B
2013-01-01 -1.019998  0.274947
2013-01-02 -1.402076  1.245495
2013-01-03  0.396147 -0.538197
2013-01-04  0.052522  0.500269
2013-01-05 -1.492344  1.145290
2013-01-06 -2.932764  1.671967

In [88]:
df.head()

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339

In [89]:

# column locatin (몇번째) index 을 이용해서 column 인덱싱
print(df.iloc[0],'\n')          # 0 을 row 인텍싱으로 생각해서 0번째 location row 을 인텍싱
print(df.iloc[:,0],'\n')        # 0 번째 column series 리턴
print(df.iloc[:,[0]])           # 0 번째 column df 리턴

A   -1.019998
B    0.274947
C    0.546842
D    0.723578
Name: 2013-01-01 00:00:00, dtype: float64

2013-01-01   -1.019998
2013-01-02   -1.402076
2013-01-03    0.396147
2013-01-04    0.052522
2013-01-05   -1.492344
2013-01-06   -2.932764
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -1.019998
2013-01-02 -1.402076
2013-01-03  0.396147
2013-01-04  0.052522
2013-01-05 -1.492344
2013-01-06 -2.932764

In [90]:
print(df.iloc[:,0:2],'\n')

                   A         B
2013-01-01 -1.019998  0.274947
2013-01-02 -1.402076  1.245495
2013-01-03  0.396147 -0.538197
2013-01-04  0.052522  0.500269
2013-01-05 -1.492344  1.145290
2013-01-06 -2.932764  1.671967

In [91]:
print(df.iloc[:,[0,1,3]],'\n')

                   A         B         D
2013-01-01 -1.019998  0.274947  0.723578
2013-01-02 -1.402076  1.245495 -0.285383
2013-01-03  0.396147 -0.538197  2.079102
2013-01-04  0.052522  0.500269  0.219367
2013-01-05 -1.492344  1.145290  0.318339
2013-01-06 -2.932764  1.671967  1.673250

In [92]:
df.rename({'A':'a'},axis=1)

                   a         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

In [93]:
df.add_suffix('_S')

                 A_S       B_S       C_S       D_S
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

In [94]:
df.loc[::-1]   # row 순서 역순

                   A         B         C         D
2013-01-06 -2.932764  1.671967  0.586408  1.673250
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-01 -1.019998  0.274947  0.546842  0.723578

In [95]:
df.loc[:,::-1]  # column 역순

                   D         C         B         A
2013-01-01  0.723578  0.546842  0.274947 -1.019998
2013-01-02 -0.285383 -0.070383  1.245495 -1.402076
2013-01-03  2.079102 -1.434322 -0.538197  0.396147
2013-01-04  0.219367  0.034893  0.500269  0.052522
2013-01-05  0.318339  1.691469  1.145290 -1.492344
2013-01-06  1.673250  0.586408  1.671967 -2.932764

Multi-indxing

In [96]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [97]:
df2.loc[0:2,'A']

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64

In [98]:
print(df2.loc[[0,1],['A','B']])    # 숫자가 lable 이다 df[[0,1]] 은 오류
print(df2.iloc[[0,1],[0,1]])

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02

In [99]:
df

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

In [100]:
df[2:6][df[2:6].A < 0][1:2]

# df 의 2부터 6 row 중 A column  값이 0 보다 작은 두번재 row

                   A         B         C        D
2013-01-06 -2.932764  1.671967  0.586408  1.67325

In [101]:
print(df[2:6])
print(df[2:6].A<0)

# 2개의 index가 같아야 한다. 
# IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

                   A         B         C         D
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

Boolean indexing

```(df[])[(df[]) 조건][column]```  
```(df[]).loc[ (df[]) 조건 , column ]```

iloc 는 boolean index 을 사용할 수 없다.  
iLocation based boolean indexing on an integer type is not available

In [102]:
df[df['A']>0]['B']

2013-01-03   -0.538197
2013-01-04    0.500269
Freq: D, Name: B, dtype: float64

In [103]:
df.loc[df['A']>0,'B']

2013-01-03   -0.538197
2013-01-04    0.500269
Freq: D, Name: B, dtype: float64

In [104]:
print(df[1:3].A > 0)  # 이거 대신
df.iloc[1:3].A > 0   # 이걸 사용하자

2013-01-02    False
2013-01-03     True
Freq: D, Name: A, dtype: bool

2013-01-02    False
2013-01-03     True
Freq: D, Name: A, dtype: bool

In [105]:
df.iloc[1:3][df.iloc[1:3].A >0]

                   A         B         C         D
2013-01-03  0.396147 -0.538197 -1.434322  2.079102

In [106]:
df[1:3][df[1:3].A > 0]   # chained indexing ???

                   A         B         C         D
2013-01-03  0.396147 -0.538197 -1.434322  2.079102

In [107]:
# df[df[1:3].A > 0]  은 오류가 난다.  df 의 index 와 df[1:3] 의 index 가 서로 맞지않다.
# 조건에 대한 true 값의 index label '2013-01-02' 을 리턴한다.
# 따라서 df['2013-01-02'] 가 오류

df[1:3].A > 0

2013-01-02    False
2013-01-03     True
Freq: D, Name: A, dtype: bool

In [108]:
# Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

# df.loc[df[1:3].A > 0] 
df[1:3].loc[df[1:3].A >0]

                   A         B         C         D
2013-01-03  0.396147 -0.538197 -1.434322  2.079102

In [109]:
df[1:3][df[0:4].A  > 0]['B']

/var/folders/yn/xbyfmttd1tdc740qcs27ft9m0000gn/T/ipykernel_9246/1907405889.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[1:3][df[0:4].A  > 0]['B']

2013-01-03   -0.538197
Freq: D, Name: B, dtype: float64

In [110]:
#  UserWarning: Boolean Series key will be reindexed to match DataFrame index. 해결방법 

X = df[1:3]
X[X[0:4].A > 0]['B']

2013-01-03   -0.538197
Freq: D, Name: B, dtype: float64

In [111]:
df[1:3][df[1:3].A > 0]['B']
# df1 = df[1:3]
# df1.A > 0
# df1['B']

2013-01-03   -0.538197
Freq: D, Name: B, dtype: float64

funtion indexing

```
pipe()  : Tablewise Function Application
apply() : Row or Column-wise Function Application (df 적용, 행/열 전달 )
agg() and transform() : Aggregation API
map() : Series 에서 값에 적용한다. (Series 적용, 값 전달)
applymap() : Applying Elementwise Functions  (df 적용, 값을 전달)

pd.cut()    : 조건에 따른 구간별 label
np.where()  : 조건에 따른 값표시 (아닌값은 NaN)
```

In [112]:
df

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

In [113]:
df3 = df.copy()
df3['sum_row'] = df3.apply(np.sum,axis=1)    # df3.sum(axis=1) 과 같다.
df3

                   A         B         C         D   sum_row
2013-01-01 -1.019998  0.274947  0.546842  0.723578  0.525368
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383 -0.512349
2013-01-03  0.396147 -0.538197 -1.434322  2.079102  0.502730
2013-01-04  0.052522  0.500269  0.034893  0.219367  0.807051
2013-01-05 -1.492344  1.145290  1.691469  0.318339  1.662754
2013-01-06 -2.932764  1.671967  0.586408  1.673250  0.998862

In [114]:
df3["result"] = df3.apply(lambda r: "Over" if r.sum_row > 0 else "Under", axis=1)
df3

                   A         B         C         D   sum_row result
2013-01-01 -1.019998  0.274947  0.546842  0.723578  0.525368   Over
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383 -0.512349  Under
2013-01-03  0.396147 -0.538197 -1.434322  2.079102  0.502730   Over
2013-01-04  0.052522  0.500269  0.034893  0.219367  0.807051   Over
2013-01-05 -1.492344  1.145290  1.691469  0.318339  1.662754   Over
2013-01-06 -2.932764  1.671967  0.586408  1.673250  0.998862   Over

In [115]:
# bins=[-100,0,100]
# labels =['under','over']      # bins 보다 하나 적은 갯수 (사이값) 이어야 한다.
pd.cut(df3.sum_row, bins=[-100,0,100], labels=['under','over'] )

2013-01-01     over
2013-01-02    under
2013-01-03     over
2013-01-04     over
2013-01-05     over
2013-01-06     over
Freq: D, Name: sum_row, dtype: category
Categories (2, object): ['under' < 'over']

In [116]:
df3 = df3.drop(columns='result')
df3

                   A         B         C         D   sum_row
2013-01-01 -1.019998  0.274947  0.546842  0.723578  0.525368
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383 -0.512349
2013-01-03  0.396147 -0.538197 -1.434322  2.079102  0.502730
2013-01-04  0.052522  0.500269  0.034893  0.219367  0.807051
2013-01-05 -1.492344  1.145290  1.691469  0.318339  1.662754
2013-01-06 -2.932764  1.671967  0.586408  1.673250  0.998862

In [117]:
df3.where((df3.sum_row>0) & (df3.B>0))    # boolean 으로 리턴하지 않고, 값을 리턴 하다. dropna() 을 붙일수 있다.

                   A         B         C         D   sum_row
2013-01-01 -1.019998  0.274947  0.546842  0.723578  0.525368
2013-01-02       NaN       NaN       NaN       NaN       NaN
2013-01-03       NaN       NaN       NaN       NaN       NaN
2013-01-04  0.052522  0.500269  0.034893  0.219367  0.807051
2013-01-05 -1.492344  1.145290  1.691469  0.318339  1.662754
2013-01-06 -2.932764  1.671967  0.586408  1.673250  0.998862

In [118]:
df3[(df3.sum_row>0) & (df3.B>0)]

# dropna() 까지 한 결과

                   A         B         C         D   sum_row
2013-01-01 -1.019998  0.274947  0.546842  0.723578  0.525368
2013-01-04  0.052522  0.500269  0.034893  0.219367  0.807051
2013-01-05 -1.492344  1.145290  1.691469  0.318339  1.662754
2013-01-06 -2.932764  1.671967  0.586408  1.673250  0.998862

### 4. Missing 

``` 
dropna()
fillna()
notnull()
notna()   
isnull()
isna() 
```

In [119]:
df3.where((df3.sum_row>0) & (df3.B>0)).fillna(0)

                   A         B         C         D   sum_row
2013-01-01 -1.019998  0.274947  0.546842  0.723578  0.525368
2013-01-02  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-03  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-04  0.052522  0.500269  0.034893  0.219367  0.807051
2013-01-05 -1.492344  1.145290  1.691469  0.318339  1.662754
2013-01-06 -2.932764  1.671967  0.586408  1.673250  0.998862

### 5. Operations

```
sum, mean, std, var
sort, count
apply
str
```

In [120]:
print(df.sort_index())
print(df.sort_values('A'),'\n')
# df.sort_values(by='A')
print(df.sort_values(by= ['A','B'],ascending=False))

                   A         B         C         D
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250
                   A         B         C         D
2013-01-06 -2.932764  1.671967  0.586408  1.673250
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-03  0.396147 -0.538197 -1.434322  2.079102

                   A         B         C         D
2013-01-03  0.396147 -0.538197 -1.434322  2.079102
2013-01-04  0.052522  0.500269  0.034893  0.219367
2013-01-01 -1.019998  0.274947  0.546842  0.723578
2013-01-02 -1.402076  1.245495 -0.070383 -0.285383
2013-01-05 -1.492344  1.145290  1.691469  0.318339
2013-01-06 -2.932764  1.671967  0.586408  1.673250

In [121]:
print(df.sum())          # row 들의 합 (col : 합) axis=0 디폴트
print(df.sum(axis=1))    # column 들의 함 (row : 합) axis=1

A   -6.398513
B    4.299770
C    1.354907
D    4.728252
dtype: float64
2013-01-01    0.525368
2013-01-02   -0.512349
2013-01-03    0.502730
2013-01-04    0.807051
2013-01-05    1.662754
2013-01-06    0.998862
Freq: D, dtype: float64

### 6. Merging

```
concat
join
merge
```

### 7. Grouping

```
Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

```

In [122]:
df_g = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df_g

     A      B         C         D
0  foo    one  1.144410 -0.436985
1  bar    one -0.072159 -0.388618
2  foo    two -0.146244  0.055403
3  bar  three  0.030107 -1.165722
4  foo    two -1.603447 -0.697050
5  bar    two -1.398144 -1.242526
6  foo    one -0.244829  0.939537
7  foo  three -1.455120  0.558759

df.groupby().groups

In [123]:
df_g.groupby(['A','B']).groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

[].reset_index / [[]].reset_index

In [124]:
df_g.groupby(['A','B'])['C'].value_counts()

# df_g.groupby(['A','B'])['C'].value_counts().reset_index() 는 오류발생. ('C' 가 중복된다. )
# new_df_g = df_g.groupby(['A','B'])['C'].value_counts()
# new_df_g.name = C_count
# new_df_g.reset_index()

A    B      C
bar  one    -0.072159    1
     three   0.030107    1
     two    -1.398144    1
foo  one    -0.244829    1
             1.144410    1
     three  -1.455120    1
     two    -1.603447    1
            -0.146244    1
Name: count, dtype: int64

In [128]:
# [[C]] 은 데이터 프레임이라서 reset_index 가 가능하다. 

df_g2 = df_g.groupby(['A','B'])[['C']].sum().reset_index()
df_g2

     A      B         C
0  bar    one -0.072159
1  bar  three  0.030107
2  bar    two -1.398144
3  foo    one  0.899581
4  foo  three -1.455120
5  foo    two -1.749691

groupby().apply()

In [130]:
# groupby 의 구룹 key 값이 전달된다. 
# 6개 그룹이 전달됨 (bar,one) 부터 (foo,two)까지
 
def funX(groupbyKey):
    return groupbyKey.sum()

df_g.groupby(['A','B'])[['C']].apply(funX)

                  C
A   B
bar one   -0.072159
    three  0.030107
    two   -1.398144
foo one    0.899581
    three -1.455120
    two   -1.749691

In [133]:
df_g.groupby(['A','B'])[['C']].sum().unstack(level=0)  # B 을 는 levle = 1

              C
A           bar       foo
B
one   -0.891268  0.045768
three -0.249629 -1.119219
two   -0.200127 -0.632051

### 8. Reshaping

```
reshpae(-1)
stack    : index <--- columns  
unstack  : index ---> columns  
pivot table
```

In [134]:
df_g.set_index(['A','B'])[['C']]#.unstack()

# Index contains duplicate entries, cannot reshape : 'foo one' 이 중복된다. 
# df.drop_duplicates(subset=['index','column']) 으로 해결

                  C
A   B
foo one   -0.135403
bar one    1.041721
foo two   -1.058521
bar three  0.350203
foo two   -1.507742
bar two   -1.220942
foo one   -0.129807
    three -0.043958

drop_duplicates

subset : 중복을 검사할 column 
keep: 중복값중 남길 행

df.drop ()
axis = 0/1 (행/열)     조건이 있는 경우 slicing 을 이용하자

In [135]:
# df_g2 = df_g.drop([6,2]).reset_index(drop=True) 
# A,B 열 값이 중복되는 2, 6 row을 삭제

df_g2 = df_g.drop_duplicates(subset=['A','B'],keep='first', ignore_index=True).copy()  # inplace = True 으로 원본 적용

df_g2

     A      B         C         D
0  foo    one -0.135403  1.466320
1  bar    one  1.041721 -0.426356
2  foo    two -1.058521  0.307807
3  bar  three  0.350203  0.071552
4  bar    two -1.220942 -0.497981
5  foo  three -0.043958 -1.271253

In [136]:
df_g2.set_index(['A','B'])[['C']].unstack()

            C
B         one     three       two
A
bar  1.041721  0.350203 -1.220942
foo -0.135403 -0.043958 -1.058521

In [137]:
df_g2.pivot(index='A',columns='B',values='C')

B         one     three       two
A
bar  1.041721  0.350203 -1.220942
foo -0.135403 -0.043958 -1.058521

pivot_table()

In [138]:
df_g2.pivot_table(index ='A',columns='B',values='C')

# pd.pivot_table(df_g2, index ='A',columns='B',values='C')

B         one     three       two
A
bar  1.041721  0.350203 -1.220942
foo -0.135403 -0.043958 -1.058521

### 9. Time Series

In [139]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    23845
Freq: 5T, dtype: int64

In [140]:
ts

2012-01-01 00:00:00    248
2012-01-01 00:00:01    141
2012-01-01 00:00:02    158
2012-01-01 00:00:03    392
2012-01-01 00:00:04    484
                      ...
2012-01-01 00:01:35    327
2012-01-01 00:01:36     84
2012-01-01 00:01:37     91
2012-01-01 00:01:38    313
2012-01-01 00:01:39    203
Freq: S, Length: 100, dtype: int64

### 10. Categroicals

### 11. Plotting